<a href="https://colab.research.google.com/github/Yogita6693/Numpy_Pandas/blob/main/PandasPractice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#1. Write a Python program to print the following string in a specific format (see the output). Go to the editor
#Sample String : "Twinkle, twinkle, little star, How I wonder what you are! Up above the world so high, Like a diamond in the sky. Twinkle, twinkle, little star, How I wonder what you are" 

print("Twinkle, twinkle, little star, \n\tHow I wonder what you are! \n\t\tUp above the world so high, \n\t\tLike a diamond in the sky. \nTwinkle, twinkle, little star, \n\tHow I wonder what you are!")

Twinkle, twinkle, little star,
	How I wonder what you are!
		Up above the world so high,
		Like a diamond in the sky.
Twinkle, twinkle, little star,
	How I wonder what you are!

In [ ]:
#2. Write a Python program to get the Python version you are using.
import sys
sys.version
print(sys.version)
print(sys.version_info)

3.7.10 (default, Feb 20 2021, 21:17:23)
[GCC 7.5.0]
sys.version_info(major=3, minor=7, micro=10, releaselevel='final', serial=0)

In [ ]:
#3. Write a Python program to display the current date and time.
import datetime
now = datetime.datetime.now()
print ("Current date and time : ")
print (now.strftime("%Y-%m-%d %H:%M:%S"))

Current date and time :
2021-04-22 10:03:53

In [ ]:
import numpy as np
import pandas as pd
country = ["India","France","England"]
capital = ["Delhi","Paris","London"]
pd.Series(data=capital)
pd.Series(data=capital,index=country)

India       Delhi
France      Paris
England    London
dtype: object

In [ ]:
arr = np.array(capital)
pd.Series(arr)

0     Delhi
1     Paris
2    London
dtype: object

In [ ]:
dict = {'a':1,'b':2,'c':3}
pd.Series(data=dict)

a    1
b    2
c    3
dtype: int64

In [ ]:
dict = {'a':1,'b':2,'c':3,"d":4,"e":5}
my_series = pd.Series(data=dict)
my_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
print(my_series[0:4])
print(my_series[2:4])

a    1
b    2
c    3
d    4
dtype: int64
c    3
d    4
dtype: int64

In [ ]:
print(my_series[-1:])
print(my_series[-4:-1])
print(my_series[:-1])

e    5
dtype: int64
b    2
c    3
d    4
dtype: int64
a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
print(my_series['a':'d'])

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
my_series + my_series

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [ ]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
#Creating Dataframe from List
fruits = ["Apple","Orange"]
fruit_df = pd.DataFrame(data = fruits)
print(fruit_df)
print("-----------")
fruit_dfN = pd.DataFrame(data = fruits,index = fruits, columns=["Fruits"])
print(fruit_dfN)

        0
0   Apple
1  Orange
-----------
        Fruits
Apple    Apple
Orange  Orange

In [ ]:
#Creating DataFrame from Nested List
people = [["Yogi",27,"O+"],["Bhumi",28,"O+"]]
people_df = pd.DataFrame(data = people,columns=["Name","Age","Blood Group"])
print(people_df)

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+

In [ ]:
#Creating DataFrame from dictionary
people = {'Name':["Yogi","Bhumi"],"Age":[27,28],"Blood Group":["O+","O+"]}
people_df = pd.DataFrame(data = people)
print(people_df)

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+

In [ ]:
#Loading files into DataFrame
#csv_df = pd.read_csv("")
#json_df = pd.read_json("")
#excel_df = pd.read_excel("")
#csv_df = pd.read_csv("",sep=',')

In [ ]:
csv_df = pd.read_csv("https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/mcdonalds_india_menu.csv")
csv_df

        Category                  Item  ...  Sodium  High_Or_Low_Sugar
0      Breakfast     Egg & Cheese Mu?n  ...     620          Low Sugar
1      Breakfast        Sausage McMu?m  ...     950          Low Sugar
2      Breakfast  Sausage & Egg McMu?m  ...    1020          Low Sugar
3      Breakfast            Veg McMu?m  ...    1000          Low Sugar
4      Breakfast      Veg Supreme Mu?n  ...     960          Low Sugar
..           ...                   ...  ...     ...                ...
78  New Products            Masala Veg  ...     920          Low Sugar
79  New Products        Masala Non Veg  ...     740          Low Sugar
80  New Products       Saucy Aloo Wrap  ...     820          Low Sugar
81  New Products    Saucy Chicken Wrap  ...     640          Low Sugar
82  New Products        Saucy Egg Wrap  ...     570          Low Sugar

[83 rows x 14 columns]

In [ ]:
csv_df.shape

(83, 14)

In [ ]:
csv_df.dtypes

Category              object
Item                  object
Serve_Size             int64
Energy                 int64
Protein                int64
Total_Fat              int64
Saturated_Fat        float64
Trans_Fat            float64
Cholestrol             int64
Carbohydrates          int64
Sugars                 int64
Dietary_Fibre          int64
Sodium                object
High_Or_Low_Sugar     object
dtype: object

In [ ]:
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Category           83 non-null     object
 1   Item               83 non-null     object
 2   Serve_Size         83 non-null     int64
 3   Energy             83 non-null     int64
 4   Protein            83 non-null     int64
 5   Total_Fat          83 non-null     int64
 6   Saturated_Fat      83 non-null     float64
 7   Trans_Fat          83 non-null     float64
 8   Cholestrol         83 non-null     int64
 9   Carbohydrates      83 non-null     int64
 10  Sugars             83 non-null     int64
 11  Dietary_Fibre      83 non-null     int64
 12  Sodium             83 non-null     object
 13  High_Or_Low_Sugar  83 non-null     object
dtypes: float64(2), int64(8), object(4)
memory usage: 9.2+ KB

In [ ]:
csv_df.count()

Category             83
Item                 83
Serve_Size           83
Energy               83
Protein              83
Total_Fat            83
Saturated_Fat        83
Trans_Fat            83
Cholestrol           83
Carbohydrates        83
Sugars               83
Dietary_Fibre        83
Sodium               83
High_Or_Low_Sugar    83
dtype: int64

In [ ]:
csv_df.index

RangeIndex(start=0, stop=83, step=1)

In [ ]:
csv_df.columns

Index(['Category', 'Item', 'Serve_Size', 'Energy', 'Protein', 'Total_Fat',
       'Saturated_Fat', 'Trans_Fat', 'Cholestrol', 'Carbohydrates', 'Sugars',
       'Dietary_Fibre', 'Sodium', 'High_Or_Low_Sugar'],
      dtype='object')

In [ ]:
import pandas as pd
people = {'Name':["Yogi","Bhumi"],"Age":[27,28],"Blood Group":["O+","O+"]}
people_df = pd.DataFrame(data = people)
print(people_df)

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+

In [ ]:
people_df.Name

0     Yogi
1    Bhumi
Name: Name, dtype: object

In [ ]:
people_df["Blood Group"]

0    O+
1    O+
Name: Blood Group, dtype: object

In [ ]:
people_df["Score"] = [98,99]
people_df

    Name  Age Blood Group  Score
0   Yogi   27          O+     98
1  Bhumi   28          O+     99

In [ ]:
#Addition of 2 columns
people_df["Sum"] = people_df["Age"]+people_df["Score"]
people_df

    Name  Age Blood Group  Score  Sum
0   Yogi   27          O+     98  125
1  Bhumi   28          O+     99  127

In [ ]:
people_df.shape

(2, 5)

In [ ]:
people_df.drop(columns="Score")

    Name  Age Blood Group  Sum
0   Yogi   27          O+  125
1  Bhumi   28          O+  127

In [ ]:
people_df

    Name  Age Blood Group  Score  Sum
0   Yogi   27          O+     98  125
1  Bhumi   28          O+     99  127

In [ ]:
people_df.drop(columns="Sum",axis = 1,inplace=True)
people_df

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+

In [ ]:
del people_df

In [ ]:
people_df

NameError: ignored

In [ ]:
import pandas as pd
people = {'Name':["Yogi","Bhumi","Som","Ram"],"Age":[27,28,29,30],"Blood Group":["O+","O+","O+","B+"]}
people_df = pd.DataFrame(data = people)
print(people_df)

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+
2    Som   29          O+
3    Ram   30          B+

In [ ]:
people_df.iloc[ :, :]

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+
2    Som   29          O+
3    Ram   30          B+

In [ ]:
people_df.iloc[1:3,0:3]

    Name  Age Blood Group
1  Bhumi   28          O+
2    Som   29          O+

In [ ]:
people_df.iloc[1:4,:2]

    Name  Age
1  Bhumi   28
2    Som   29
3    Ram   30

In [ ]:
people_df.loc[1:3,"Name"]

1    Bhumi
2      Som
3      Ram
Name: Name, dtype: object

In [ ]:
people_df

    Name  Age Blood Group
0   Yogi   27          O+
1  Bhumi   28          O+
2    Som   29          O+
3    Ram   30          B+

In [ ]:
people_df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
people_df.loc[1:4,"Name":"Blood Group"]

    Name  Age Blood Group
1  Bhumi   28          O+
2    Som   29          O+
3    Ram   30          B+

In [ ]:
#Concatenating of 2 DataFrames
dict1 = {"Id":[1,2,3,4,5],"Name":['a','b','c','d','e'],"Sub":['S1','S2','S3','S4','S5']}
dict2 = {"Id":[1,2,3,4,5],"Name":['b','c','d','e','f'],"Sub":['S3','S4','S5','S6','S7']}
df1 = pd.DataFrame(data = dict1)
df2 = pd.DataFrame(data = dict2)
print(df1)
print("----------------------------")
print(df2)

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
----------------------------
   Id Name Sub
0   1    b  S3
1   2    c  S4
2   3    d  S5
3   4    e  S6
4   5    f  S7

In [ ]:
pd.concat([df1,df2],axis=0)

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
0   1    b  S3
1   2    c  S4
2   3    d  S5
3   4    e  S6
4   5    f  S7

In [ ]:
pd.concat([df1,df2],axis=1)

   Id Name Sub  Id Name Sub
0   1    a  S1   1    b  S3
1   2    b  S2   2    c  S4
2   3    c  S3   3    d  S5
3   4    d  S4   4    e  S6
4   5    e  S5   5    f  S7

In [ ]:
dict1 = {"Id":[1,2,3,4,5],"Name":['a','b','c','d','e'],"Sub":['S1','S2','S3','S4','S5']}
dict2 = {"Id":[1,2,3,4,5],"Name":['b','c','d','e','f'],"Sub":['S3','S4','S5','S6','S7']}
df1 = pd.DataFrame(data = dict1)
df2 = pd.DataFrame(data = dict2)
print(df1)
print("----------------------------")
print(df2)

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
----------------------------
   Id Name Sub
0   1    b  S3
1   2    c  S4
2   3    d  S5
3   4    e  S6
4   5    f  S7

In [ ]:
#Merging of 2 DataFrames--This is used to join dataframes based on any column as key
pd.merge(left=df1,right=df2,on="Sub")      #matching data from both table is called inner join

   Id_x Name_x Sub  Id_y Name_y
0     3      c  S3     1      b
1     4      d  S4     2      c
2     5      e  S5     3      d

In [ ]:
#Left Join(left outer join in SQL)
pd.merge(left=df1,right=df2,on="Sub",how="left")

   Id_x Name_x Sub  Id_y Name_y
0     1      a  S1   NaN    NaN
1     2      b  S2   NaN    NaN
2     3      c  S3   1.0      b
3     4      d  S4   2.0      c
4     5      e  S5   3.0      d

In [ ]:
#Right Join(right outer join in SQL)
pd.merge(left=df1,right=df2,on="Sub",how="right")

   Id_x Name_x Sub  Id_y Name_y
0   3.0      c  S3     1      b
1   4.0      d  S4     2      c
2   5.0      e  S5     3      d
3   NaN    NaN  S6     4      e
4   NaN    NaN  S7     5      f

In [ ]:
#Outer Join is nothing but the combination of left join and right join
pd.merge(left=df1,right=df2,on="Sub",how="outer")

   Id_x Name_x Sub  Id_y Name_y
0   1.0      a  S1   NaN    NaN
1   2.0      b  S2   NaN    NaN
2   3.0      c  S3   1.0      b
3   4.0      d  S4   2.0      c
4   5.0      e  S5   3.0      d
5   NaN    NaN  S6   4.0      e
6   NaN    NaN  S7   5.0      f

In [ ]:
#Append
df3 = pd.DataFrame({"Id":[6],"Name":["e"],"Sub":["S6"]})
print(df3)
df1.append(df3)

   Id Name Sub
0   6    e  S6

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
0   6    e  S6

In [ ]:
df1.append(df3,ignore_index=True)

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
5   6    e  S6

In [ ]:
#Conditions in DataFrame---
#This is used to perform comparision on the records of DataFrame.
#The output of comparision is of boolean type.
df1

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5

In [ ]:
df1["Id"]>2

0    False
1    False
2     True
3     True
4     True
Name: Id, dtype: bool

In [ ]:
df1[df1['Id']>2]

   Id Name Sub
2   3    c  S3
3   4    d  S4
4   5    e  S5

In [ ]:
~(df1["Id"]>2)

0     True
1     True
2    False
3    False
4    False
Name: Id, dtype: bool

In [ ]:
df1[~(df1['Id']>2)]

   Id Name Sub
0   1    a  S1
1   2    b  S2

In [ ]:
df1

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5

In [ ]:
df1["Name"]!="d"

0     True
1     True
2     True
3    False
4     True
Name: Name, dtype: bool

In [ ]:
df1[df1["Name"]!="d"]

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
4   5    e  S5

In [ ]:
df1[(df1["Name"]!="d") & (df1['Id']>2)]

   Id Name Sub
2   3    c  S3
4   5    e  S5

In [ ]:
df1[(df1["Name"]!="d") | (df1['Id']>2)]

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5

In [ ]:
df3 = pd.concat([df1,df2],axis=0)
df3

   Id Name Sub
0   1    a  S1
1   2    b  S2
2   3    c  S3
3   4    d  S4
4   5    e  S5
0   1    b  S3
1   2    c  S4
2   3    d  S5
3   4    e  S6
4   5    f  S7

In [ ]:
#Multi Indexing DataFrame
df3.loc['b']

   Sub
Id
2   S2
1   S3

In [1]:
#Tips Data
import seaborn as sns
import pandas as pd

In [2]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [ ]:
tips.describe()

In [6]:
tips['size'].unique()

array([2, 3, 4, 1, 6, 5])

In [8]:
tips[tips.time == "Lunch"].head()

    total_bill   tip   sex smoker   day   time  size
77       27.20  4.00  Male     No  Thur  Lunch     4
78       22.76  3.00  Male     No  Thur  Lunch     2
79       17.29  2.71  Male     No  Thur  Lunch     2
80       19.44  3.00  Male    Yes  Thur  Lunch     2
81       16.66  3.40  Male     No  Thur  Lunch     2

In [9]:
tips[tips.time == "Lunch"].sum()

total_bill    1167.47
tip            185.51
size           164.00
dtype: float64

In [10]:
tips[tips.time == "Lunch"]["tip"].sum()

185.51000000000002

In [11]:
tips[tips.time == "Lunch"]["tip"].count()

68

In [14]:
tips.shape

(244, 7)

In [15]:
tips.groupby(["time"]).mean()

        total_bill       tip      size
time
Lunch    17.168676  2.728088  2.411765
Dinner   20.797159  3.102670  2.630682

In [19]:
tips.groupby(["time"]).agg(["sum","mean","count"])

       total_bill                      tip                 size
              sum       mean count     sum      mean count  sum      mean count
time
Lunch     1167.47  17.168676    68  185.51  2.728088    68  164  2.411765    68
Dinner    3660.30  20.797159   176  546.07  3.102670   176  463  2.630682   176

In [20]:
tips.groupby(["time","sex"]).agg(["sum","mean","count"])

              total_bill                      tip  ...       size
                     sum       mean count     sum  ... count  sum      mean count
time   sex                                         ...
Lunch  Male       595.60  18.048485    33   95.11  ...    33   78  2.363636    33
       Female     571.87  16.339143    35   90.40  ...    35   86  2.457143    35
Dinner Male      2661.22  21.461452   124  389.96  ...   124  335  2.701613   124
       Female     999.08  19.213077    52  156.11  ...    52  128  2.461538    52

[4 rows x 9 columns]

In [21]:
tips.groupby(["time"])[["tip","total_bill"]].agg(["sum","mean","count"])

           tip                 total_bill
           sum      mean count        sum       mean count
time
Lunch   185.51  2.728088    68    1167.47  17.168676    68
Dinner  546.07  3.102670   176    3660.30  20.797159   176

In [22]:
tips.groupby(["time","day"])[["tip","total_bill"]].agg(["sum","mean","count"])

                tip                 total_bill
                sum      mean count        sum       mean count
time   day
Lunch  Thur  168.83  2.767705    61    1077.55  17.664754    61
       Fri    16.68  2.382857     7      89.92  12.845714     7
       Sat      NaN       NaN     0        NaN        NaN     0
       Sun      NaN       NaN     0        NaN        NaN     0
Dinner Thur    3.00  3.000000     1      18.78  18.780000     1
       Fri    35.28  2.940000    12     235.96  19.663333    12
       Sat   260.40  2.993103    87    1778.40  20.441379    87
       Sun   247.39  3.255132    76    1627.16  21.410000    76

In [23]:
tips.index

RangeIndex(start=0, stop=244, step=1)

In [25]:
tip = tips.head(10)
tip

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [26]:
tip.set_index(["sex"])

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Male         10.34  1.66     No  Sun  Dinner     3
Male         21.01  3.50     No  Sun  Dinner     3
Male         23.68  3.31     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4
Male         25.29  4.71     No  Sun  Dinner     4
Male          8.77  2.00     No  Sun  Dinner     2
Male         26.88  3.12     No  Sun  Dinner     4
Male         15.04  1.96     No  Sun  Dinner     2
Male         14.78  3.23     No  Sun  Dinner     2

In [27]:
tip.set_index(["sex","time"])

               total_bill   tip smoker  day  size
sex    time
Female Dinner       16.99  1.01     No  Sun     2
Male   Dinner       10.34  1.66     No  Sun     3
       Dinner       21.01  3.50     No  Sun     3
       Dinner       23.68  3.31     No  Sun     2
Female Dinner       24.59  3.61     No  Sun     4
Male   Dinner       25.29  4.71     No  Sun     4
       Dinner        8.77  2.00     No  Sun     2
       Dinner       26.88  3.12     No  Sun     4
       Dinner       15.04  1.96     No  Sun     2
       Dinner       14.78  3.23     No  Sun     2

In [28]:
multi_index_tips = tip.set_index(["sex","size"])

In [29]:
multi_index_tips.sort_index(inplace=True)

In [30]:
multi_index_tips.xs(2,level="size")

        total_bill   tip smoker  day    time
sex
Male         23.68  3.31     No  Sun  Dinner
Male          8.77  2.00     No  Sun  Dinner
Male         15.04  1.96     No  Sun  Dinner
Male         14.78  3.23     No  Sun  Dinner
Female       16.99  1.01     No  Sun  Dinner

In [31]:
#Applying a function on DataFrame
people = [['Rick',60, 'O+'], ['Morty', 10, 'O+'], ['Summer', 45,'A-'], ['Beth',18,'B+']]
people_df = pd.DataFrame(people, columns=['Name','Score', 'Blood Group'])
people_df

     Name  Score Blood Group
0    Rick     60          O+
1   Morty     10          O+
2  Summer     45          A-
3    Beth     18          B+

In [33]:
people_df["Score"]*2

0    120
1     20
2     90
3     36
Name: Score, dtype: int64

In [38]:
people_df["Score"]

0    60
1    10
2    45
3    18
Name: Score, dtype: int64

In [41]:
def time2(x):
  num = x
  if x%6 == 0:
    num*=2
  return num

In [42]:
people_df["Score"].apply(time2)

0    120
1     10
2     45
3     36
Name: Score, dtype: int64

In [43]:
people_df["Score"].apply(lambda x:x*2)

0    120
1     20
2     90
3     36
Name: Score, dtype: int64

In [48]:
people_df["Score"].apply(lambda x : x*2)

0    120
1     20
2     90
3     36
Name: Score, dtype: int64